const express = require('express')
const app = express()
const teachers = [
    { name: 'Іщенко Ганна Валеріївна' },
    { name: 'Артюхов Віталій Григорович' },
    { name: 'Безносик Олександр Юрійович' },
    { name: 'Бритов Олексій Анатолійович' },
    { name: 'Булах Богдан Вікторович' },
    { name: 'Гіоргізова-Гай Вікторія Шалвівна' },
    { name: 'Голубова Ірина Андріївна' },
    { name: 'Капшук Олег Олексійович' },
    { name: 'Кирюша Богдан Анатолійович' },
    { name: 'Кисельов Геннадій Дмитрович' },
    { name: 'Петренко Анатолій Іванович' },
    { name: 'Романов Валерій Володимирович' },
    { name: 'Сергеєв-Горчинський Олексій Олександрович' },
    { name: 'Стіканов Валерій Юхимович' },
    { name: 'Чкалов Олексій Валерійович' }
]

app.get('/cad-teachers', (req, res) => {
    res.json(teachers)
})

app.listen(3000, () => {
    console.log('The server is running on localhost:3000/cad-teachers')
})